_site/boj-15990/index.html
<div id="outline-container-org86a4919" class="outline-2">
<h2 id="org86a4919">BOJ 16194 1,2,3 더하기 5</h2>
<div class="outline-text-2" id="text-org86a4919">
<ul class="org-ul">
<li>1,2,3 을 이용해서 정수 N을 만드는 경우의 수를 구함</li>
<li>같은 수를 두번 이상 사용하면 안된다는 조건이 있음</li>
</ul>
</div>
</div>
<div id="outline-container-org2cc18f2" class="outline-2">
<h2 id="org2cc18f2">접근하기</h2>
<div class="outline-text-2" id="text-org2cc18f2">
<pre class="example">

점화식 아이디어

dp[숫자][1로끝나는경우]
dp[숫자][2로끝나는경우]
dp[숫자][3로끝나는경우]


1을 만드는 경우 1
dp[1][1] = 1
dp[1][2] = 0
dp[1][3] = 0

2를 만드는 경우 1
dp[2][1] = 0
dp[2][2] = 1
dp[2][3] = 0


3을 만드는 경우 3
1 + 1 + 1     dp[3][1] = 1
1 + 2         dp[3][2] = 1
3             dp[3][3] = 1

dp[7][1] = dp[6][2] + dp[6][3]
dp[7][2] = dp[5][1] + dp[5][3]
dp[7][3] = dp[4][1] + dp[4][2]
</pre>
</div>
</div>

<div id="outline-container-org212f476" class="outline-2">
<h2 id="org212f476">코드</h2>
<div class="outline-text-2" id="text-org212f476">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #888a85;">// </span><span style="color: #888a85;">https://jdselectron.tistory.com/71</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">MOD</span> 1000000009

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">T</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">unsigned</span> <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dp</span>[100010][3];  <span style="color: #888a85;">// </span><span style="color: #888a85;">10&#50613;&#50473; 3&#48264; &#45908;&#54616;&#45716; &#44221;&#50864;&#44032; &#51080;&#51020; - uint&#45208; long long</span>

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;T);

 <span style="color: #888a85;">//   </span><span style="color: #888a85;">dp[0][1] = 0; </span>
 <span style="color: #888a85;">//   </span><span style="color: #888a85;">dp[0][2] = 0; </span>
 <span style="color: #888a85;">//   </span><span style="color: #888a85;">dp[0][3] = 0; </span>

    dp[1][1] = 1; 
 <span style="color: #888a85;">//   </span><span style="color: #888a85;">dp[1][2] = 0; </span>
 <span style="color: #888a85;">//   </span><span style="color: #888a85;">dp[1][3] = 0; </span>

 <span style="color: #888a85;">//   </span><span style="color: #888a85;">dp[2][1] = 0; </span>
    dp[2][2] = 1; 
 <span style="color: #888a85;">//   </span><span style="color: #888a85;">dp[2][3] = 0; </span>

    dp[3][1] = 1; 
    dp[3][2] = 1; 
    dp[3][3] = 1; 

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=4;i&lt;=100000;i++) {
        dp[i][1] = (dp[i-1][2]%MOD + dp[i-1][3]%MOD)%MOD; 
        dp[i][2] = (dp[i-2][1]%MOD + dp[i-2][3]%MOD)%MOD;
        dp[i][3] = (dp[i-3][1]%MOD + dp[i-3][2]%MOD)%MOD;
    }

    <span style="color: #729fcf; font-weight: bold;">while</span>(T--) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>;
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;num);
        printf(<span style="color: #ad7fa8; font-style: italic;">"%u\n"</span>, (dp[num][1]%MOD + dp[num][2]%MOD + dp[num][3]%MOD)%MOD);
    }

    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcce41d4" class="outline-2">
<h2 id="orgcce41d4">문제 링크</h2>
<div class="outline-text-2" id="text-orgcce41d4">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/15990">https://www.acmicpc.net/problem/15990</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb583444" class="outline-2">
<h2 id="orgb583444">풀이/설명 참고</h2>
<div class="outline-text-2" id="text-orgb583444">
<ul class="org-ul">
<li><a href="https://velog.io/@jkh9615/%EC%95%8C%EA%B3%A0%EB%A6%AC%EC%A6%98-%EB%B0%B1%EC%A4%80-15990-1-2-3-%EB%8D%94%ED%95%98%EA%B8%B0-5-Java">velog.io/@jkh9615</a></li>
</ul>
</div>
</div>
